Revit 2024 API
BuiltInFailures.SteelElementsFailures.SteelElementModifiersWillBeIgnoredWarn Property
 The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SteelElementModifiersWillBeIgnoredWarn { get; }
Visual Basic
Public Shared ReadOnly Property SteelElementModifiersWillBeIgnoredWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SteelElementModifiersWillBeIgnoredWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SteelElementsFailures Class
Autodesk.Revit.DB Namespace